MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DX128VMC7/mcu.h
#define CAN0_MCR                      (*((volatile uint32_t *)0x40024000))      // Module Configuration Register (CAN0_MCR)
#define CAN0_CTRL1                    (*((volatile uint32_t *)0x40024004))      // Control 1 register (CAN0_CTRL1)
#define CAN0_TIMER                    (*((volatile uint32_t *)0x40024008))      // Free Running Timer (CAN0_TIMER)
#define CAN0_RXMGMASK                 (*((volatile uint32_t *)0x40024010))      // Rx Mailboxes Global Mask Register (CAN0_RXMGMASK)
#define CAN0_RX14MASK                 (*((volatile uint32_t *)0x40024014))      // Rx 14 Mask register (CAN0_RX14MASK)
#define CAN0_RX15MASK                 (*((volatile uint32_t *)0x40024018))      // Rx 15 Mask register (CAN0_RX15MASK)
#define CAN0_ECR                      (*((volatile uint32_t *)0x4002401C))      // Error Counter (CAN0_ECR)
#define CAN0_ESR1                     (*((volatile uint32_t *)0x40024020))      // Error and Status 1 register (CAN0_ESR1)
#define CAN0_IMASK1                   (*((volatile uint32_t *)0x40024028))      // Interrupt Masks 1 register (CAN0_IMASK1)
#define CAN0_IFLAG1                   (*((volatile uint32_t *)0x40024030))      // Interrupt Flags 1 register (CAN0_IFLAG1)
#define CAN0_CTRL2                    (*((volatile uint32_t *)0x40024034))      // Control 2 register (CAN0_CTRL2)
#define CAN0_ESR2                     (*((volatile uint32_t *)0x40024038))      // Error and Status 2 register (CAN0_ESR2)
#define CAN0_CRCR                     (*((volatile uint32_t *)0x40024044))      // CRC Register (CAN0_CRCR)
#define CAN0_RXFGMASK                 (*((volatile uint32_t *)0x40024048))      // Rx FIFO Global Mask register (CAN0_RXFGMASK)
#define CAN0_RXFIR                    (*((volatile uint32_t *)0x4002404C))      // Rx FIFO Information Register (CAN0_RXFIR)
#define CAN0_RXIMR0                   (*((volatile uint32_t *)0x40024880))      // Rx Individual Mask Registers (CAN0_RXIMR0)
#define CAN0_RXIMR1                   (*((volatile uint32_t *)0x40024884))      // Rx Individual Mask Registers (CAN0_RXIMR1)
#define CAN0_RXIMR2                   (*((volatile uint32_t *)0x40024888))      // Rx Individual Mask Registers (CAN0_RXIMR2)
#define CAN0_RXIMR3                   (*((volatile uint32_t *)0x4002488C))      // Rx Individual Mask Registers (CAN0_RXIMR3)
#define CAN0_RXIMR4                   (*((volatile uint32_t *)0x40024890))      // Rx Individual Mask Registers (CAN0_RXIMR4)
#define CAN0_RXIMR5                   (*((volatile uint32_t *)0x40024894))      // Rx Individual Mask Registers (CAN0_RXIMR5)
#define CAN0_RXIMR6                   (*((volatile uint32_t *)0x40024898))      // Rx Individual Mask Registers (CAN0_RXIMR6)
#define CAN0_RXIMR7                   (*((volatile uint32_t *)0x4002489C))      // Rx Individual Mask Registers (CAN0_RXIMR7)
#define CAN0_RXIMR8                   (*((volatile uint32_t *)0x400248A0))      // Rx Individual Mask Registers (CAN0_RXIMR8)
#define CAN0_RXIMR9                   (*((volatile uint32_t *)0x400248A4))      // Rx Individual Mask Registers (CAN0_RXIMR9)
#define CAN0_RXIMR10                  (*((volatile uint32_t *)0x400248A8))      // Rx Individual Mask Registers (CAN0_RXIMR10)
#define CAN0_RXIMR11                  (*((volatile uint32_t *)0x400248AC))      // Rx Individual Mask Registers (CAN0_RXIMR11)
#define CAN0_RXIMR12                  (*((volatile uint32_t *)0x400248B0))      // Rx Individual Mask Registers (CAN0_RXIMR12)
#define CAN0_RXIMR13                  (*((volatile uint32_t *)0x400248B4))      // Rx Individual Mask Registers (CAN0_RXIMR13)
#define CAN0_RXIMR14                  (*((volatile uint32_t *)0x400248B8))      // Rx Individual Mask Registers (CAN0_RXIMR14)
#define CAN0_RXIMR15                  (*((volatile uint32_t *)0x400248BC))      // Rx Individual Mask Registers (CAN0_RXIMR15)


//*****************************************************************************
//
// Serial Peripheral Interface (SPI) registers
//
//*****************************************************************************

#define SPI0_MCR                      (*((volatile uint32_t *)0x4002C000))      // Module Configuration Register
#define SPI0_TCR                      (*((volatile uint32_t *)0x4002C008))      // DSPI Transfer Count Register
#define SPI0_CTAR0                    (*((volatile uint32_t *)0x4002C00C))      // DSPI Clock and Transfer Attributes Register (In Master Mode)
#define SPI0_CTAR0_SLAVE              (*((volatile uint32_t *)0x4002C00C))      // DSPI Clock and Transfer Attributes Register (In Slave Mode)
#define SPI0_CTAR1                    (*((volatile uint32_t *)0x4002C010))      // DSPI Clock and Transfer Attributes Register (In Master Mode)
#define SPI0_SR                       (*((volatile uint32_t *)0x4002C02C))      // DSPI Status Register
#define SPI0_RSER                     (*((volatile uint32_t *)0x4002C030))      // DSPI DMA/Interrupt Request Select and Enable Register
#define SPI0_PUSHR                    (*((volatile uint32_t *)0x4002C034))      // DSPI PUSH TX FIFO Register In Master Mode
#define SPI0_PUSHR_SLAVE              (*((volatile uint32_t *)0x4002C034))      // DSPI PUSH TX FIFO Register In Slave Mode
#define SPI0_POPR                     (*((volatile uint32_t *)0x4002C038))      // DSPI POP RX FIFO Register
#define SPI0_TXFR0                    (*((volatile uint32_t *)0x4002C03C))      // DSPI Transmit FIFO Registers
#define SPI0_TXFR1                    (*((volatile uint32_t *)0x4002C040))      // DSPI Transmit FIFO Registers
#define SPI0_TXFR2                    (*((volatile uint32_t *)0x4002C044))      // DSPI Transmit FIFO Registers
#define SPI0_TXFR3                    (*((volatile uint32_t *)0x4002C048))      // DSPI Transmit FIFO Registers
#define SPI0_RXFR0                    (*((volatile uint32_t *)0x4002C07C))      // DSPI Receive FIFO Registers
#define SPI0_RXFR1                    (*((volatile uint32_t *)0x4002C080))      // DSPI Receive FIFO Registers
#define SPI0_RXFR2                    (*((volatile uint32_t *)0x4002C084))      // DSPI Receive FIFO Registers
#define SPI0_RXFR3                    (*((volatile uint32_t *)0x4002C088))      // DSPI Receive FIFO Registers
#define SPI1_MCR                      (*((volatile uint32_t *)0x4002D000))      // Module Configuration Register
#define SPI1_TCR                      (*((volatile uint32_t *)0x4002D008))      // DSPI Transfer Count Register
#define SPI1_CTAR0                    (*((volatile uint32_t *)0x4002D00C))      // DSPI Clock and Transfer Attributes Register (In Master Mode)
#define SPI1_CTAR0_SLAVE              (*((volatile uint32_t *)0x4002D00C))      // DSPI Clock and Transfer Attributes Register (In Slave Mode)
#define SPI1_CTAR1                    (*((volatile uint32_t *)0x4002D010))      // DSPI Clock and Transfer Attributes Register (In Master Mode)
#define SPI1_SR                       (*((volatile uint32_t *)0x4002D02C))      // DSPI Status Register
#define SPI1_RSER                     (*((volatile uint32_t *)0x4002D030))      // DSPI DMA/Interrupt Request Select and Enable Register
#define SPI1_PUSHR                    (*((volatile uint32_t *)0x4002D034))      // DSPI PUSH TX FIFO Register In Master Mode
#define SPI1_PUSHR_SLAVE              (*((volatile uint32_t *)0x4002D034))      // DSPI PUSH TX FIFO Register In Slave Mode
#define SPI1_POPR                     (*((volatile uint32_t *)0x4002D038))      // DSPI POP RX FIFO Register
#define SPI1_TXFR0                    (*((volatile uint32_t *)0x4002D03C))      // DSPI Transmit FIFO Registers
#define SPI1_TXFR1                    (*((volatile uint32_t *)0x4002D040))      // DSPI Transmit FIFO Registers
#define SPI1_TXFR2                    (*((volatile uint32_t *)0x4002D044))      // DSPI Transmit FIFO Registers
#define SPI1_TXFR3                    (*((volatile uint32_t *)0x4002D048))      // DSPI Transmit FIFO Registers
#define SPI1_RXFR0                    (*((volatile uint32_t *)0x4002D07C))      // DSPI Receive FIFO Registers
#define SPI1_RXFR1                    (*((volatile uint32_t *)0x4002D080))      // DSPI Receive FIFO Registers
#define SPI1_RXFR2                    (*((volatile uint32_t *)0x4002D084))      // DSPI Receive FIFO Registers
#define SPI1_RXFR3                    (*((volatile uint32_t *)0x4002D088))      // DSPI Receive FIFO Registers


//*****************************************************************************
//
// Inter-Integrated Circuit (I2C) registers
//
//*****************************************************************************

#define I2C0_A1                       (*((volatile uint32_t *)0x40066000))      // I2C Address Register 1
#define I2C0_F                        (*((volatile uint32_t *)0x40066001))      // I2C Frequency Divider register
#define I2C0_C1                       (*((volatile uint32_t *)0x40066002))      // I2C Control Register 1
#define I2C0_S                        (*((volatile uint32_t *)0x40066003))      // I2C Status register
#define I2C0_D                        (*((volatile uint32_t *)0x40066004))      // I2C Data I/O register
#define I2C0_C2                       (*((volatile uint32_t *)0x40066005))      // I2C Control Register 2
#define I2C0_FLT                      (*((volatile uint32_t *)0x40066006))      // I2C Programmable Input Glitch Filter register
#define I2C0_RA                       (*((volatile uint32_t *)0x40066007))      // I2C Range Address register
#define I2C0_SMB                      (*((volatile uint32_t *)0x40066008))      // I2C SMBus Control and Status register
#define I2C0_A2                       (*((volatile uint32_t *)0x40066009))      // I2C Address Register 2
#define I2C0_SLTH                     (*((volatile uint32_t *)0x4006600A))      // I2C SCL Low Timeout Register High
#define I2C0_SLTL                     (*((volatile uint32_t *)0x4006600B))      // I2C SCL Low Timeout Register Low
#define I2C1_A1                       (*((volatile uint32_t *)0x40067000))      // I2C Address Register 1
#define I2C1_F                        (*((volatile uint32_t *)0x40067001))      // I2C Frequency Divider register
#define I2C1_C1                       (*((volatile uint32_t *)0x40067002))      // I2C Control Register 1
#define I2C1_S                        (*((volatile uint32_t *)0x40067003))      // I2C Status register
#define I2C1_D                        (*((volatile uint32_t *)0x40067004))      // I2C Data I/O register
#define I2C1_C2                       (*((volatile uint32_t *)0x40067005))      // I2C Control Register 2
#define I2C1_FLT                      (*((volatile uint32_t *)0x40067006))      // I2C Programmable Input Glitch Filter register
#define I2C1_RA                       (*((volatile uint32_t *)0x40067007))      // I2C Range Address register
#define I2C1_SMB                      (*((volatile uint32_t *)0x40067008))      // I2C SMBus Control and Status register
#define I2C1_A2                       (*((volatile uint32_t *)0x40067009))      // I2C Address Register 2
#define I2C1_SLTH                     (*((volatile uint32_t *)0x4006700A))      // I2C SCL Low Timeout Register High
#define I2C1_SLTL                     (*((volatile uint32_t *)0x4006700B))      // I2C SCL Low Timeout Register Low


//*****************************************************************************
//
// Universal Asynchronous Receiver/Transmitter (UART) registers
//
//*****************************************************************************

